clear_item_list = [
    ";",
    "'"
]

replace_dict = {
    "=": "",
    "()": "0",
    ",": ".",
    "O": "0",
    "О": "0",
    "U": "0",
    "{": "0",
    "'": "",
    "f; ": "4",
    "S": "9",
    ")": "",
    "*": "",
    "шт": "",
    "ШТ": "",
    "Шт": "",
    "С": "0",}

invalid_value = [
    "бонусная карта",
    "Бонусная карта",
    "Номер карты",
    'Номер',
    'XXX',
    "xxx",
    "***",
    "%* * *",
    "***",
    "# #",
    "##",
    "#_",
    "# #",
]

code_text_start = "^[ ]?[0-9]{5,14}[^.]"
code = r"[0-9]{5,}[^.]"
clear_code = "[0-9]{5,14}"
# quantity = r"\*[ ,.0-9]+"
quantity = "\*\s?[0-9]{1,4}[, .]{1,2}\d{2,}|[OО]\s?[.,]\s?\d{3}|[0-9]{1,3}\s?[ШшТт]{2}"
bonus = r"бону[а-я] [0-9.]+|[Сс]ки[дл]ка[\w\W]+"
# price_and_cost = r"[0-9,.А-Я]{4,}"
price_and_cost = "[0-9][0-9]{0,3}\W?[,.][0-9 С]{2,3}"
separate_products_throw_text = r"\s{1}[0-9]{5,13} [а-яА-Я%]{3,}\s?[а-яА-Я0-9]{1,}|П[АаКкЕеТт]{4}"

repair_keys = ['cost', 'price', 'code', 'quantity']