clear_item_list = [
    ";",
    "'"
]

replace_dict = {
    "=": "",
    "()": "0",
    ",": ".",
    "O": "0",
    "U": "0",
    "{": "0",
    "'": "",
    "f; ": "4",
    "S": "9",
}

invalid_value = [
    "бонусная карта",
    "Бонусная карта",
    "%* * *",
    "***",
    "# #",
    "##",
    "# #",
    "Номер карты",
    'Номер',
    'XXX',
    "xxx",
    "***"
]

code_text_start = "^[ ]?[0-9]{5,14}[^.]"
code = r"[0-9]{5,}[^.]"
clear_code = "[0-9]{5,14}"
quantity = r"\*[ ,.0-9]+"
bonus = r"бону[а-я] [0-9.]+"
price_and_cost = r"[0-9,.А-Я]{4,}"
separate_products_throw_text = r"\s{1}[0-9]{5,13} [а-яА-Я%]{4,}|П[АаКкЕеТт]{4}"